smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
private:
    Factory(const Factory&) = delete;
    Factory& operator=(const Factory&) = delete;
    explicit Factory(uint32_t aClkRate = 120000000)
        : mClkRate(aClkRate)
        , mSSIPinCfg(nullptr)
        , mSPIDev(nullptr)
        , mRTCC(nullptr)
        , mRTCCAO(nullptr)
        , mFileLogSink(nullptr)
        , mMotorControl(nullptr)
        , mPFPPAO(nullptr)
        , mDisplayMgrAO(nullptr)
        , mSDC(nullptr) {

        // Ctor.
        // SPIDev is required with several devices.
        mSPIDev = std::unique_ptr<CoreLink::SPIDev>(CreateSPIDev(0));

        // TODO: CONSIDER CREATING RTCC HERE TOO.

        Init();
    }


    void Init(void) {
        // NOTE: SystemInit() already called from the startup code,
        // where clock already set (CLOCK_SETUP in lm3s_config.h)
        // SystemCoreClockUpdate() also called from there.
        // Settings done for 50MHz system clock.

        mClkRate = SysCtlClockFreqSet(
            SYSCTL_XTAL_25MHZ
                | SYSCTL_OSC_MAIN
                | SYSCTL_USE_PLL
                | SYSCTL_CFG_VCO_480,
            mClkRate
        );

        // Enable the clock to the peripherals used by the application.

        // Enable all required GPIO.
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);

#ifdef Q_SPY
        // Debug UART port.
        GPIO lU0RxGPIO(GPIOC_AHB_BASE, GPIO_PIN_4);
        GPIO lU0TxGPIO(GPIOC_AHB_BASE, GPIO_PIN_5);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
        MAP_GPIOPinTypeUART(
            lU0RxGPIO.GetPort(),
            lU0RxGPIO.GetPin() | lU0TxGPIO.GetPin()
        );
        //UARTStdioInit(0);
        // Enable UART0:
        // @115200, 8-N-1.
        // Interrupt on rx FIFO half-full.
        // UART interrupts: rx and rx-to.
        // Flush the buffers.
        MAP_UARTConfigSetExpClk(
            UART0_BASE,
            mClkRate,//SysCtlClockGet(),
            UART_BAUD_RATE,
            (UART_CONFIG_PAR_NONE
            | UART_CONFIG_STOP_ONE
            | UART_CONFIG_WLEN_8)
        );
        MAP_UARTFIFOLevelSet(UART0_BASE, UART_FIFO_TX1_8, UART_FIFO_RX4_8);
        MAP_UARTEnable(UART0_BASE);

        // Enable interrupts.
        MAP_UARTIntDisable(UART0_BASE, 0xFFFFFFFF);
        MAP_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
        MAP_IntEnable(INT_UART0);

        // Initialize the QS software tracing.
        if (0U == QS_INIT(nullptr)) {
            Q_ERROR();
        }
        QS_OBJ_DICTIONARY(&BSP::Factory::sSysTick_Handler);
        //QS_OBJ_DICTIONARY(&sGPIOPortA_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortC_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortD_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortF_IRQHandler);
#endif // Q_SPY
    }


    CoreLink::SPIDev * CreateSPIDev(unsigned int aSSIID) {
        switch (aSSIID) {
        case 0:
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
            mSSIPinCfg = std::make_unique<SSI0PinCfg>();
            return new CoreLink::SPIDev(SSI0_BASE, mClkRate, *mSSIPinCfg);

        case 1:
        default:
            return nullptr;
        }
    }


    std::unique_ptr<DS3234> CreateRTCC(void) {
        // Creates a DS3234 RTCC.
        // Calls the Ctor that uses default SPI slave configuration,
        // with specified CSn pin.
        unsigned long lInterruptNumber = INT_GPIOA;
        GPIO lCSnPin(GPIOA_AHB_BASE, GPIO_PIN_7);
        auto lRTCC = std::make_unique<DS3234>(
            2000,
            lInterruptNumber,
            mRTCCInterruptPin,
            *mSPIDev,
            lCSnPin
        );

        return lRTCC;
    }

    std::unique_ptr<TB6612> CreateMotorControl(void) {
        GPIO lIn1(GPIOB_AHB_BASE, GPIO_PIN_6);
        GPIO lIn2(GPIOB_AHB_BASE, GPIO_PIN_5);
        GPIO lPWM(GPIOB_AHB_BASE, GPIO_PIN_0);

        return std::make_unique<TB6612>(lIn1, lIn2, lPWM);
    }


    // When LwIP::AO::Mgr can get rid of any local reference to LwIPDrv,
    // it won't be necessary for this function to return a pointer to EthDrv.
    // It will be referenced via LwIPDrv static functions.
    std::unique_ptr<EthDrv> CreateEthDrv(void) {
        EthernetAddress lMAC = GetMACAddress();
        unsigned int lMyNetIFIndex = 0;
        unsigned int lPBufQueueSize = 8;
        auto lEthDrv = std::make_unique<EthDrv>(
            lMyNetIFIndex,
            lMAC,
            lPBufQueueSize
        );

        return lEthDrv;
    }


#if 0
    std::unique_ptr<BLE::BLE> CreateBLE(void) {
        unsigned long lInterruptNumber = INT_GPIOB;
        GPIO lCSnPin(GPIOB_AHB_BASE, GPIO_PIN_4);
        auto lBLE = std::make_unique<BLE::BLE>(
            lInterruptNumber,
            mBLEInterruptPin,
            *mSPIDev,
            lCSnPin
        );

        return lBLE;
    }
#endif


    EthernetAddress GetMACAddress(void) {
        // For the Stellaris Eval Kits, the MAC address will be stored in the
        // non-volatile USER0 and USER1 registers. These registers can be read
        // using the FlashUserGet function, as illustrated below.
        unsigned long lUser0 = 0;
        unsigned long lUser1 = 0;
        FlashUserGet(&lUser0, &lUser1);

        // Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC address.
        EthernetAddress lMAC(
            static_cast<uint8_t>((lUser0 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser0 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser0 & 0x00FF0000L) >> 16),
            static_cast<uint8_t>((lUser0 & 0xFF000000L) >> 24),
            static_cast<uint8_t>((lUser1 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser1 & 0x0000FF00L) >>  8)
        );

        if (lMAC.IsValid()) {
            return lMAC;
        }

        return EthernetAddress(0x00, 0x50, 0x1d, 0xc2, 0x70, 0xff);
    }

    uint32_t mClkRate;
    std::unique_ptr<CoreLink::SSIPinCfg> mSSIPinCfg;
    std::unique_ptr<CoreLink::SPIDev> mSPIDev;
    std::unique_ptr<DS3234> mRTCC;
    std::shared_ptr<RTCC::AO::RTCC_AO> mRTCCAO;
    std::shared_ptr<Logging::AO::FileSink_AO> mFileLogSink;
    std::unique_ptr<TB6612> mMotorControl;
    std::shared_ptr<PFPP::AO::Mgr_AO> mPFPPAO;
    std::shared_ptr<Display::AO::Mgr_AO> mDisplayMgrAO;
    std::shared_ptr<SDC> mSDC;
    std::unique_ptr<EthDrv> mEthDrv;
    std::shared_ptr<LwIP::AO::Mgr_AO> mLwIPMgrAO;
    //std::unique_ptr<BLE::BLE> mBLE;
    //std::shared_ptr<PFPP::AO::BLE_AO> mBLEAO;

    static GPIO const mRTCCInterruptPin;
    //static GPIO const mBLEInterruptPin;

