smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
    static std::shared_ptr<IBSPFactory> mInstance;
};

} // namespace BSP


// *****************************************************************************
//                            FUNCTION PROTOTYPES
// *****************************************************************************

namespace BSP {
static void InitEtherLED(void);
static void InitUserLED(void);
static void SetUserLED(void);
static void ClrUserLED(void);
} // namespace BSP

// *****************************************************************************
//                             GLOBAL VARIABLES
// *****************************************************************************

#ifdef Q_SPY
// For local extern "C" functions, not part of any namespace.
static QP::QSTimeCtr QS_tickTime_ = 0;
static QP::QSTimeCtr const QS_tickPeriod_ = SystemCoreClock / BSP::TICKS_PER_SEC;

namespace BSP {
    // event-source identifiers used for tracing
    uint8_t const Factory::sSysTick_Handler = 0U;
    uint8_t const Factory::sGPIOPortA_IRQHandler = 0U;
}

#endif // Q_SPY


// Button class should become GPIO class.
std::shared_ptr<IBSPFactory> BSP::Factory::mInstance = nullptr;
GPIO const BSP::Factory::mRTCCInterruptPin(GPIOA_AHB_BASE, GPIO_PIN_6);
//GPIO const BSP::Factory::mBLEInterruptPin(GPIOB_AHB_BASE, GPIO_PIN_1);


namespace BSP {

// Those variables are used locally in various stubs and IRQ handlers.
static Button const mManualFeedButton(GPIOJ_AHB_BASE, GPIO_PIN_0, INT_GPIOJ, 0);
static Button const mTimedFeedButton(GPIOJ_AHB_BASE, GPIO_PIN_1, INT_GPIOJ, 0);
//static Button const mSelectButton(GPIOF_AHB_BASE, GPIO_PIN_1, INT_GPIOF, 0);

static GPIO const sUserLEDPin(GPION_BASE, GPIO_PIN_0);
} // namespace BSP

// *****************************************************************************
//                            EXPORTED FUNCTIONS
// *****************************************************************************

namespace BSP {

std::shared_ptr<IBSPFactory> Init(void) {
    return Factory::Instance();
}


}  // namespace BSP

// *****************************************************************************
//                              LOCAL FUNCTIONS
// *****************************************************************************

namespace BSP {


static void InitEtherLED(void) {

    // GPIO for Ethernet LEDs.
    GPIO const lLinkLEDPin(GPIOF_AHB_BASE, GPIO_PIN_4);
    MAP_GPIOPinTypeGPIOOutput(lLinkLEDPin.GetPort(), lLinkLEDPin.GetPin());
    MAP_GPIOPadConfigSet(
        lLinkLEDPin.GetPort(),
        lLinkLEDPin.GetPin(),
        GPIO_STRENGTH_2MA,
        GPIO_PIN_TYPE_STD
    );
    MAP_GPIOPinTypeEthernetLED(lLinkLEDPin.GetPort(), lLinkLEDPin.GetPin());

    GPIO const lActivityLEDPin(GPIOF_AHB_BASE, GPIO_PIN_0);
    MAP_GPIOPinTypeGPIOOutput(lActivityLEDPin.GetPort(), lActivityLEDPin.GetPin());
    MAP_GPIOPadConfigSet(
        lActivityLEDPin.GetPort(),
        lActivityLEDPin.GetPin(),
        GPIO_STRENGTH_2MA,
        GPIO_PIN_TYPE_STD
    );
    MAP_GPIOPinTypeEthernetLED(lActivityLEDPin.GetPort(), lActivityLEDPin.GetPin());

    MAP_IntEnable(INT_EMAC0);
}


static void InitUserLED(void) {
    // GPIO for user LED toggling during idle.
    MAP_GPIOPinTypeGPIOOutput(sUserLEDPin.GetPort(), sUserLEDPin.GetPin());
    MAP_GPIOPadConfigSet(
        sUserLEDPin.GetPort(),
        sUserLEDPin.GetPin(),
        GPIO_STRENGTH_2MA,
        GPIO_PIN_TYPE_STD
    );
    MAP_GPIOPinWrite(
        sUserLEDPin.GetPort(),
        sUserLEDPin.GetPin(),
        sUserLEDPin.GetPin()
    );
}


static void SetUserLED(void) {

    MAP_GPIOPinWrite(
        sUserLEDPin.GetPort(),
        sUserLEDPin.GetPin(),
        sUserLEDPin.GetPin()
    );
}


static void ClrUserLED(void) {

    MAP_GPIOPinWrite(
        sUserLEDPin.GetPort(),
        sUserLEDPin.GetPin(),
        0
    );
}

} // namespace BSP


// QF callbacks ==============================================================
void QP::QF::onStartup(void) {

    // Set up the SysTick timer to fire at BSP_TICKS_PER_SEC rate
    MAP_SysTickPeriodSet(SysCtlClockGet() / BSP::TICKS_PER_SEC);
    MAP_IntPrioritySet(FAULT_SYSTICK, 0x80); //SYSTICK_PRIO
    MAP_SysTickIntEnable();
    MAP_SysTickEnable();

    // Assign all priority bits for preemption-prio. and none to sub-prio.
    //NVIC_SetPriorityGrouping(0U); from CMSIS
    MAP_IntPriorityGroupingSet(0U);
    MAP_IntPrioritySet(INT_GPIOA, 0x20); //GPIOPORTA_PRIO);
    MAP_IntPrioritySet(INT_GPIOB, 0x20); //GPIOPORTA_PRIO);
    MAP_IntPrioritySet(INT_GPIOC, 0x60); //GPIOPORTA_PRIO);
    MAP_IntPrioritySet(INT_GPIOD, 0x60); //GPIOPORTA_PRIO);
    MAP_IntPrioritySet(INT_GPIOE, 0x40); //GPIOPORTE_PRIO);
    //MAP_IntPrioritySet(INT_GPIOF, 0x60); //GPIOPORTF_PRIO);
    MAP_IntPrioritySet(INT_EMAC0, 0x60);

    NVIC_SetPriority(UART0_IRQn, UART0_PRIO);

    // Init user LED.
    // Init Ethernet LEDs.
    BSP::InitUserLED();
    BSP::InitEtherLED();

    // Manual Feed cap sensor input.
    // Timed Feed cap sensor input.
    BSP::mManualFeedButton.EnableInt();
    BSP::mTimedFeedButton.EnableInt();
    //BSP::mSelectButton.EnableInt();

#ifdef Q_SPY
    // UART0 interrupt used for QS-RX.
    NVIC_EnableIRQ(UART0_IRQn);
#endif // Q_SPY
}


//............................................................................
// called with interrupts disabled, see NOTE01
void QP::QV::onIdle(void) {

    // Toggle LED for visual effect.
    BSP::SetUserLED();
    BSP::ClrUserLED();

#ifdef Q_SPY
    QF_INT_ENABLE();

    // Parse all the received bytes.
    QS::rxParse();

    // TX done?
    if (MAP_UARTSpaceAvail(UART0_BASE)) {
        // Max bytes we can accept.
        uint16_t lFIFOLen = UART_TXFIFO_DEPTH;

        QF_INT_DISABLE();
        // Try to get next block to transmit.
        uint8_t const *lBlockPtr = QS::getBlock(&lFIFOLen);
        QF_INT_ENABLE();

        // Any bytes in the block?
        while (lFIFOLen-- != 0U) {
            // Put into the FIFO.
            MAP_UARTCharPut(UART0_BASE, *lBlockPtr++);
        }
    }

#elif defined NDEBUG
    // Put the CPU and peripherals to the low-power mode.
    // you might need to customize the clock management for your application,
    // see the datasheet for your particular Cortex-M3 MCU.
    //
    // Atomically go to sleep and enable interrupts.
    QV_CPU_SLEEP();
#else
    // Just enable interrupts.
    QF_INT_ENABLE();
#endif // Q_SPY
}


//............................................................................
extern "C" void Q_onAssert(char const *module, int loc) {
    //
    // NOTE: add here your application-specific error handling
    //
    (void)module;
    (void)loc;
    QS_ASSERTION(module, loc, static_cast<uint32_t>(10000U));
    NVIC_SystemReset();
}


#ifdef QF_ACTIVE_STOP
void QP::QActive::stop(void) {
    // Unsubscribe from all events.
    // Remove this object from QF.
    QP::QActive::unsubscribeAll();
    QP::QF::remove_(this);
}
#endif // QF_ACTIVE_STOP

// QS callbacks ==============================================================
#ifdef Q_SPY

//............................................................................
bool QP::QS::onStartup(void const *aArgPtr) {

