smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
#if 0
// GPIO port F interrupt handler.
void GPIOPortF_IRQHandler(void);
void GPIOPortF_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOIntStatus(GPIOF_AHB_BASE, lIsMasked);
    unsigned int lPin = BSP::mSelectButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOIntClear(GPIOF_AHB_BASE, lPin);
        // Only interested in the pin coming high.
        QP::QActive * const lDisplayMgrAO = BSP::Factory::Instance()->GetOpaqueDisplayMgrAO();
        if (nullptr != lDisplayMgrAO) {
            if (Button::IS_HIGH == BSP::mSelectButton.GetGPIOPinState()) {
                static QP::QEvt const sEvent(DISPLAY_REFRESH_SIG);
                lDisplayMgrAO->POST(&sEvent, 0);
            }
        }
    }
}
#endif

#ifdef Q_SPY
void UART0_IRQHandler(void);
// ISR for receiving bytes from the QSPY Back-End
// NOTE: This ISR is "QF-unaware" meaning that it does not interact with
// the QF/QK and is not disabled.
// Such ISRs don't need to call QK_ISR_ENTRY/QK_ISR_EXIT
// and they cannot post or publish events.
//
void UART0_IRQHandler(void) {
    // Get the raw interrupt status.
    // Clear the asserted interrupts.
    unsigned long lStatus = MAP_UARTIntStatus(UART0_BASE, true);
    MAP_UARTIntStatus(UART0_BASE, lStatus);

    // While RX FIFO NOT empty.
    while (MAP_UARTCharsAvail(UART0_BASE)) {
        unsigned long lLongByte = MAP_UARTCharGet(UART0_BASE);
        uint8_t lByte = static_cast<uint8_t>(lLongByte);
        QP::QS::rxPut(lByte);
    }
}
#else // Q_SPY
// Intentional undefined function body.
#endif // Q_SPY


// TODO: make this conditional to Ethernet support.
void Ethernet_IRQHandler(void);
void Ethernet_IRQHandler(void) {
    LwIPDrv::StaticISR(0);
}


} // extern C

// *****************************************************************************
//                                END OF FILE
// *****************************************************************************
